openfoam/tutorials/lagrangian/reactingParcelFoam/splashPanel/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel thermoSingleLayer;

region          wallFilmRegion;

active          true;

thermoSingleLayerCoeffs
{
    filmThermoModel liquid;

    liquidCoeffs
    {
        useReferenceValues  no;
        liquid      H2O;
    }

    filmViscosityModel liquid;

    deltaWet    2e-4;
    hydrophilic no;

    turbulence  laminar;
    laminarCoeffs
    {
        Cf          0.005;
    }

    forces
    (
        thermocapillary
    );

    injectionModels
    ();

    phaseChangeModel none;

    radiationModel none;

    upperSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0                1e-8;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0                1e-8;
        }
    }
}


// ************************************************************************* //
